_mark_path = 'img/{}.jpg'

_mark = [
    ['battle', 0.8, '检测主界面-探险', [90, 700]],
    ['guild', 0.8, '检测主界面-公会', [72, 468]],
    ['不选择可选', 0.8, '按钮'],
    ['处理可选', 0.8, '按钮'],
    ['确认可选', 0.8, '按钮'],
    ['选择不可选', 0.8, '按钮'],
    ['卡马逊通关奖励', 0.8, '奖励选择页面'],
    ['选择不可选', 0.8, '按钮'],
    ['选择战利品', 0.8, '按钮'],
    ['战斗中', 0.8, '是否处于卡马逊战斗中'],
    ['低阶神器', 0.8, '神器选择'],
    ['中阶神器', 0.8, '神器选择'],
    ['高阶神器', 0.8, '神器选择'],
    ['卡马逊战斗选择', 0.8, '卡马逊战斗准备阶段'],
    ['取消可选', 0.8, '按钮'],
    ['挑战可选', 0.8, '检测主界面', [765, 494]],
    ['支援神器', 0.8, '按钮'],
    ['pointer', 0.8, '按钮'],
    ['圆形角斗场', 0.8, '按钮'],
    ['确认', 0.8, '按钮'],
    ['卡马逊乐园', 0.8, '按钮'],
    ['挑战结束', 0.8, '按钮'],
    ['退出', 0.8, '按钮'],
    ['战斗中', 0.8, '按钮'],
]


def all_mark_piece(_mark):
    return _mark_path.format(_mark[0]), _mark[1], _mark[2]


def search_mark(name):
    for i in _mark:
        if name == i[0]:
            return all_mark_piece(i)


# 左上角为0，0
_coordinates = {
    '探险': [90, 700],
    '公会': [1180, 535],
    '卡马逊乐园': [1200, 408],
    '多玩家对决': [80, 607],
    '裂痕': [80, 285],
    '圆形角斗场': [80, 500],
    '邮件': [1180, 30],
    '左上角返回': [30, 40],
    '卡马逊难度左': [518, 423],
    '卡马逊难度右': [1217, 423],
    '卡马逊难度1': [660, 460],
    '卡马逊难度2': [860, 460],
    '卡马逊难度3': [1060, 460],
    '挑战副本': [973, 683],
    '挑战': [1022, 732],
}

# 给与事件一个优先级选项
_events = {
    '苦行': 4,
    '阿加莎商店': 4,
    '赛季事件1': 1,
    '赛季事件2': 1,
    '赛季事件3': 1,
}

_items = {
    '箱子': 'box',
}
